FORMAT: 1A

# 主要解决内容格式问题与自动分类和人工标注的结合

+ [线上] 爬虫后台管理
    + 种子网站管理
        + [API] 新增种子网站
        + [API] 删除种子网站
        + [API] 修改种子网站（e.g 修改模板）
    + 调度中心 
        + [API] 触发器管理:负责任务与触发器的关联管理. e.g : 一个触发器关联一个或多个任务
        + [API] 调度器管理:负责何时调度触发器. e.g : 每周或每天
        + [API] 开启/终止调度
    + 任务中心
        + [API] 爬虫任务: 线下爬虫(workers)轮询处理任务, 依据种子ID判断任务类型:
            + 增量爬取任务
            + 全量更新任务
            + 任务路由
                + VPN队列
                + 普通队列
    + 监控 : 监控线下爬虫系统的健康度
        + [API] 线上生产库与线下爬虫的连通性或心跳
        + [API] 爬虫系统的状态信息 e.g : (运行中, 待命中, 终止)
        + [API] 网站模板是否发生变化
            + 间接方式:基于抓取数据的成功率, 与数据完整性(小于特定阈值时给予警报)
        + [API] 邮件报警
    + 统计
        + [API] 爬取数据统计
            + N小时内各个网站新增数据统计等
    
+ [线上] 机器学习后台管理
    + 分类调整 (不断完善模型，完善训练数据)
        + [API] 高优先级的单条数据类别修改
            + 某一个数据到指定分类(中英文). topics_classification表增加一个新的人工分类字段, 需要修改Posts.classification()方法, 优先使用人工分类字段.
            + 修改成功后, 要修改topics对应数据的最后更新时间
        + [API] 低优先级的多数据修改 
            + 某一个分类到指定分类(中英文). 新建立分类映射关系表(初始化数据 category.properties); 采用分类级别的前缀匹配或全匹配模式(post_text的category字段).
                + 第一种方式是建立无等级结构的类别映射, 所有级别拼写在一行对应我们自己的类别
                + 第二种方式是建立有等级结构的类别映射
            + 修改成功后, 要修改topics对应数据的最后更新时间 (修改topics的时间比较麻烦, 需要查post_text表然后更新topic，而且没有索引)
        + 分类规则/约束
            + 手工填写的分类必须是正确的, 一级类别必须是预定义列表中的类别
    + 分类模型
        + [API] 重新生成模型
        + [API] 增量自动分类 
        + [API] 全量自动分类 
            + 重新生成模型时使用全量更新, 但是不覆盖用户干预的记录.
        + [API] 训练样本管理相关API
            + 查看样本数据
            + 手工标注错误的数据并修复
            + 添加新样本到训练样本集合中
    + 词典管理
        + [API] 分类单词的中英文对照词典需要记录一份, 并可以修改与调整
    + 类别管理

+ [线下] 机器学习 分类
    + 相关问题
        + 分析项目代码需要修改，去掉手工映射分类部分的代码
        + 多类分类问题: 因为我们是多类分类, 所以有些二值分类算法就不能选择了. 一级类别不建议太多, 或者在保证每个类别有很多样本可训练时, 才可以有更多的类别.
        + 准确性问题: 用作__预测变量的原始特征__和__目标变量的类别__选择的好坏, 决定了系统的准确性, 不存在单一的正确性, 要尝试各种不同的方法. 开发分类器是个动态的过程, 要创造性的思考出描述数据特征的最佳方式, 并考虑在训练模型所选用的学习算法中如何使用这些数据特征.
        + 目标泄露问题: 对太理想的模型保持怀疑态度, 检查预测变量中是否有目标变量. (可能存在目标泄露 target leak)
    + 构建分类模型的流程较之前发生变化 (新建表结构或字段, 区别哪些数据是训练样本)
        + 使用迭代的方式（人工干预 -> 机器学习 -> 循环）不断优化分类
        + [API] 随着时间的推移, 将人工__采样__生产环境中的样本并将其加入到训练数据中, 这样可以生成不断更新的模型版本. 因为爬虫系统不断爬取新数据的这种能力会导致当外部条件发生改变时致使分类决策质量随时间推移不断下降的问题。
            + 周期性的修复或重新训练模型
        + [API] 这里的采样指: 人工随机抽取到的数据, 包括:
            + 模型分类不准确的数据, 并通过人工标注修复的数据
            + 模型分类准确的新样本数据, 但是不包含在之前的训练样本中的
                + 人工标注后, 加入到下次的训练样本集合中.
        + 限制
            + 这里有个问题就是, 人工标注的数据仅限于一级类别作为分类系统的目标变量, 非一级类别不参与到分类系统的分析中.
            + 目标变量必须在预定义的列表中选择并区分大小写, e.g : 产品的16个类别.
    + 分类的三个阶段: 训练, 评估和调优, 目前系统只有训练阶段, 没有评估和调优阶段. (新建一些表结构来满足后台管理相关的需求)
        + 加入对评估阶段的监控与日志记录. 了解模型性能是否满足需求, 一旦满足需求就可以投入到生产环境中. (正确率大于 82% ~ 83% 就基本可以了) 
        + 加入对调优阶段的流程控制
        + 实时评估模型, 以检查模型的准确度
    + 训练阶段, 不断加入训练样本的个数
        + 每次训练后通过人工干预的方式将新的样本数据加入到训练数据中, 即手工将错误数据划分到正确的分类中并作为下次模型迭代的输入, 然后再次生成模型. 目的是让训练样本的个数不断扩大. (不断迭代该模式, 周期性执行)
        + [API] 分类算法基于样例学习, 并不能取代人的判断. 所以要加入人工干预的流程. NOTE:分类是一种有监督的学习形式. (之前我们并没有人为的去监督分类模型)
        + 对于产品的一级类别要人工定义好, 人工干预的训练样本, 必须满足这个定义.
        + 非一级类别只采用category映射的方式, 不使用机器学习的方式, 也不实用聚类方式, 根据爬取网站的非一级类别我们人工处理.
    + 关于分类系统的性能
        + 当分类系统的准确性下降时, 并不一定要放弃这种方法. 使用合适的训练数据重新训练模型就足够了
    + 模型质量预警, 实时评估, 当质量下降到某一个阈值后报警
    + 看visio图

+ [工具类] HTML格式优化
    + 压缩:
        + 剔除无效空格(&nbsp; 特殊空格等 setRemoveIntertagSpaces)
        + 剔除无有效内容的HTML元素 e.g : <p> &nbsp; <p>
        + 剔除部分指定的HTML转移字符, 要观察爬取的HTML结构进行总结
        + 剔除无用的多级嵌套标签 e.g <div><div>this is a example</div></div>
        + img ul ol等元素的优化
    + 无图片数据低优先
    + 无内容数据低优先
    + 制定一个格式规则
        + 最外层标签是什么？ div OR p
        + h系列标签优化
    + 标题格式化, 删除特殊空格

+ 搜索引擎相关(暂略)
    + 分词
        + 中文停用词系统
